Diagram refactoring
